In [235]:
import os

In [236]:
os.chdir('E:\my practise proj\practise loan pred proj')

In [237]:
os.getcwd()

'E:\\my practise proj\\practise loan pred proj'

In [238]:
import pandas as pd

In [239]:
train=pd.read_excel('train.xlsx')

In [240]:
test=pd.read_excel('test.xlsx')

In [241]:
train['source']='train'

In [242]:
test['source']='test'

In [243]:
train.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,source
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y,train
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N,train
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y,train
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y,train
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y,train

In [244]:
test.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'source'],
      dtype='object')

In [245]:
data=pd.concat([train,test], ignore_index=True)

C:\Users\L\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [246]:
train.shape,test.shape,data.shape

((614, 14), (367, 13), (981, 14))

In [247]:
data.columns

Index(['ApplicantIncome', 'CoapplicantIncome', 'Credit_History', 'Dependents',
       'Education', 'Gender', 'LoanAmount', 'Loan_Amount_Term', 'Loan_ID',
       'Loan_Status', 'Married', 'Property_Area', 'Self_Employed', 'source'],
      dtype='object')

In [248]:
data.head()

,ApplicantIncome,CoapplicantIncome,Credit_History,Dependents,Education,Gender,LoanAmount,Loan_Amount_Term,Loan_ID,Loan_Status,Married,Property_Area,Self_Employed,source
0,5849,0.0,1.0,0,Graduate,Male,NaN,360.0,LP001002,Y,No,Urban,No,train
1,4583,1508.0,1.0,1,Graduate,Male,128.0,360.0,LP001003,N,Yes,Rural,No,train
2,3000,0.0,1.0,0,Graduate,Male,66.0,360.0,LP001005,Y,Yes,Urban,Yes,train
3,2583,2358.0,1.0,0,Not Graduate,Male,120.0,360.0,LP001006,Y,Yes,Urban,No,train
4,6000,0.0,1.0,0,Graduate,Male,141.0,360.0,LP001008,Y,No,Urban,No,train

In [249]:
data.dtypes

ApplicantIncome        int64
CoapplicantIncome    float64
Credit_History       float64
Dependents            object
Education             object
Gender                object
LoanAmount           float64
Loan_Amount_Term     float64
Loan_ID               object
Loan_Status           object
Married               object
Property_Area         object
Self_Employed         object
source                object
dtype: object

In [250]:
data.describe()

,ApplicantIncome,CoapplicantIncome,Credit_History,LoanAmount,Loan_Amount_Term
count,981.000000,981.000000,902.000000,954.000000,961.000000
mean,5179.795107,1601.916330,0.835920,142.511530,342.201873
std,5695.104533,2718.772806,0.370553,77.421743,65.100602
min,0.000000,0.000000,0.000000,9.000000,6.000000
25%,2875.000000,0.000000,1.000000,100.000000,360.000000
50%,3800.000000,1110.000000,1.000000,126.000000,360.000000
75%,5516.000000,2365.000000,1.000000,162.000000,360.000000
max,81000.000000,41667.000000,1.000000,700.000000,480.000000

In [251]:
data.isnull().sum()

ApplicantIncome        0
CoapplicantIncome      0
Credit_History        79
Dependents            25
Education              0
Gender                24
LoanAmount            27
Loan_Amount_Term      20
Loan_ID                0
Loan_Status          367
Married                3
Property_Area          0
Self_Employed         55
source                 0
dtype: int64

In [252]:
data['Gender'].value_counts()

Male      775
Female    182
Name: Gender, dtype: int64

In [253]:
data['Gender'].fillna('Male',inplace=True)

In [254]:
data['Married'].value_counts()

Yes    631
No     347
Name: Married, dtype: int64

In [255]:
data['Married'].fillna('Yes',inplace=True)

In [256]:
data['Dependents'].value_counts()

0     545
2     160
1     160
3+     91
Name: Dependents, dtype: int64

In [257]:
data['Dependents'].fillna(2,inplace=True)

In [258]:
data['Self_Employed'].value_counts()

No     807
Yes    119
Name: Self_Employed, dtype: int64

In [259]:
data['Self_Employed'].fillna('No',inplace=True)

In [260]:
data['LoanAmount'].fillna(data['LoanAmount'].mean(),inplace=True)

In [261]:
data['Loan_Amount_Term'].fillna(data['Loan_Amount_Term'].mean(),inplace=True)

In [262]:
data['Credit_History'].fillna(data['Credit_History'].mean(),inplace=True)

In [263]:
data['CoapplicantIncome'].replace(0,data['CoapplicantIncome'].mean(),inplace=True)

In [264]:
data.isnull().sum()

ApplicantIncome        0
CoapplicantIncome      0
Credit_History         0
Dependents             0
Education              0
Gender                 0
LoanAmount             0
Loan_Amount_Term       0
Loan_ID                0
Loan_Status          367
Married                0
Property_Area          0
Self_Employed          0
source                 0
dtype: int64

In [265]:
data['Loan_Status']=data['Loan_Status'].replace({'Y':1,'N':0})

In [266]:
data.dtypes

ApplicantIncome        int64
CoapplicantIncome    float64
Credit_History       float64
Dependents            object
Education             object
Gender                object
LoanAmount           float64
Loan_Amount_Term     float64
Loan_ID               object
Loan_Status          float64
Married               object
Property_Area         object
Self_Employed         object
source                object
dtype: object

In [267]:
data=pd.get_dummies(data,columns=['Dependents','Education','Gender','Married','Property_Area','Self_Employed'])

In [268]:
data.shape

(981, 23)

In [269]:
data.head()

,ApplicantIncome,CoapplicantIncome,Credit_History,LoanAmount,Loan_Amount_Term,Loan_ID,Loan_Status,source,Dependents_0,Dependents_1,...,Education_Not Graduate,Gender_Female,Gender_Male,Married_No,Married_Yes,Property_Area_Rural,Property_Area_Semiurban,Property_Area_Urban,Self_Employed_No,Self_Employed_Yes
0,5849,1601.91633,1.0,142.51153,360.0,LP001002,1.0,train,1,0,...,0,0,1,1,0,0,0,1,1,0
1,4583,1508.00000,1.0,128.00000,360.0,LP001003,0.0,train,0,1,...,0,0,1,0,1,1,0,0,1,0
2,3000,1601.91633,1.0,66.00000,360.0,LP001005,1.0,train,1,0,...,0,0,1,0,1,0,0,1,0,1
3,2583,2358.00000,1.0,120.00000,360.0,LP001006,1.0,train,1,0,...,1,0,1,0,1,0,0,1,1,0
4,6000,1601.91633,1.0,141.00000,360.0,LP001008,1.0,train,1,0,...,0,0,1,1,0,0,0,1,1,0

In [270]:
train1=data.loc[data['source']=="train"]
test1=data.loc[data['source']=="test"]

In [271]:
train1.drop(['source','Loan_ID'],axis=1,inplace=True)
test1.drop(['source'],axis=1,inplace=True)

C:\Users\L\Anaconda3\lib\site-packages\pandas\core\frame.py:3940: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  errors=errors)

In [272]:
train1.to_csv('train1.modified.csv', index=False)

In [273]:
test1.to_csv('test1.modified.csv', index=False)

In [274]:
newtrain=pd.read_csv('train1.modified.csv')

In [275]:
newtrain.head()

,ApplicantIncome,CoapplicantIncome,Credit_History,LoanAmount,Loan_Amount_Term,Loan_Status,Dependents_0,Dependents_1,Dependents_2,Dependents_3+,...,Education_Not Graduate,Gender_Female,Gender_Male,Married_No,Married_Yes,Property_Area_Rural,Property_Area_Semiurban,Property_Area_Urban,Self_Employed_No,Self_Employed_Yes
0,5849,1601.91633,1.0,142.51153,360.0,1.0,1,0,0,0,...,0,0,1,1,0,0,0,1,1,0
1,4583,1508.00000,1.0,128.00000,360.0,0.0,0,1,0,0,...,0,0,1,0,1,1,0,0,1,0
2,3000,1601.91633,1.0,66.00000,360.0,1.0,1,0,0,0,...,0,0,1,0,1,0,0,1,0,1
3,2583,2358.00000,1.0,120.00000,360.0,1.0,1,0,0,0,...,1,0,1,0,1,0,0,1,1,0
4,6000,1601.91633,1.0,141.00000,360.0,1.0,1,0,0,0,...,0,0,1,1,0,0,0,1,1,0

In [276]:
x_train=newtrain.drop(['Loan_Status'],axis=1)

In [277]:
y_train=newtrain['Loan_Status']

In [278]:
newtest=pd.read_csv('test1.modified.csv')

In [279]:
newtest.head()

,ApplicantIncome,CoapplicantIncome,Credit_History,LoanAmount,Loan_Amount_Term,Loan_ID,Loan_Status,Dependents_0,Dependents_1,Dependents_2,...,Education_Not Graduate,Gender_Female,Gender_Male,Married_No,Married_Yes,Property_Area_Rural,Property_Area_Semiurban,Property_Area_Urban,Self_Employed_No,Self_Employed_Yes
0,5720,1601.91633,1.00000,110.0,360.0,LP001015,NaN,1,0,0,...,0,0,1,0,1,0,0,1,1,0
1,3076,1500.00000,1.00000,126.0,360.0,LP001022,NaN,0,1,0,...,0,0,1,0,1,0,0,1,1,0
2,5000,1800.00000,1.00000,208.0,360.0,LP001031,NaN,0,0,1,...,0,0,1,0,1,0,0,1,1,0
3,2340,2546.00000,0.83592,100.0,360.0,LP001035,NaN,0,0,1,...,0,0,1,0,1,0,0,1,1,0
4,3276,1601.91633,1.00000,78.0,360.0,LP001051,NaN,1,0,0,...,1,0,1,1,0,0,0,1,1,0

In [280]:
x_test=newtest

In [281]:
x_test.shape

(367, 22)

In [282]:
from sklearn.ensemble import RandomForestClassifier

In [283]:
clf=RandomForestClassifier(n_estimators=150,max_depth=20,n_jobs=20)

In [284]:
clf.fit(x_train,y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=20, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=150, n_jobs=20,
            oob_score=False, random_state=None, verbose=0,
            warm_start=False)

In [285]:
clf.score(x_train,y_train)

1.0

In [286]:
My_test=x_test.drop(['Loan_ID','Loan_Status'],axis=1)

In [287]:
My_test.columns

Index(['ApplicantIncome', 'CoapplicantIncome', 'Credit_History', 'LoanAmount',
       'Loan_Amount_Term', 'Dependents_0', 'Dependents_1', 'Dependents_2',
       'Dependents_3+', 'Education_Graduate', 'Education_Not Graduate',
       'Gender_Female', 'Gender_Male', 'Married_No', 'Married_Yes',
       'Property_Area_Rural', 'Property_Area_Semiurban', 'Property_Area_Urban',
       'Self_Employed_No', 'Self_Employed_Yes'],
      dtype='object')

In [288]:
predict=clf.predict(My_test)

In [289]:
predict

array([1., 1., 1., 1., 1., 1., 1., 0., 1., 1., 0., 1., 1., 0., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 0., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 0., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 0., 1., 1., 0., 1., 1., 1., 1., 0., 1., 1., 0., 0.,
       1., 0., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 0., 1., 0.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 0., 1., 1., 1., 1., 0., 1., 0.,
       1., 0., 1., 1., 0., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 0., 0.,
       0., 1., 1., 1., 0., 0., 1., 0., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 0., 1., 1., 1., 1., 0., 1., 1., 1., 1., 1.,
       0., 1., 1., 1., 1., 1., 0., 1., 0., 1., 1., 1., 0., 0., 1., 0., 0.,
       1., 1., 1., 0., 0., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 0., 1., 0., 1., 0., 0., 1., 1., 0., 1., 0., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 0., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 0., 1., 1., 1., 1., 0., 1., 1., 1., 1., 1., 0., 0., 1.,
       1., 0., 1., 0., 1., 0., 1., 0., 1., 1., 1., 1., 0., 1., 1., 1., 1.,
       0., 0., 1., 1., 0., 1., 1., 1., 1., 1., 1., 0., 1., 0., 1., 1., 1.,
       1., 0., 0., 1., 1., 1., 0., 0., 1., 1., 1., 0., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 0., 1., 1., 1., 1., 1., 1., 1., 0., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 0., 1., 1., 1., 1., 0., 0., 1., 1., 1., 0., 1.,
       1., 1., 0., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 0.,
       1., 1., 0., 1., 1., 1., 0., 1., 1., 1., 1., 0., 1., 1., 0., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1.])

In [290]:
clf.score(My_test,predict)

1.0

In [291]:
my_submission=pd.DataFrame({'Loan_ID':x_test.Loan_ID,'Loan_Status': predict})

In [292]:
my_submission.to_csv('submission20.csv',index=False)